
; ============================================================
; sum.asm —— 求和
; ============================================================

.model small
.stack 100h

.data
result DW 0

.code
START:
    MOV AX,@DATA
    MOV DS,AX

    MOV CX,100               ; 循环 100 次
    MOV AX,0                 ; AX 保存累加结果
    MOV BX,1                 ; BX 保存当前加数

SUM_LOOP:
    ADD AX,BX                ; 累加当前数字
    INC BX                   ; 下一个数字
    LOOP SUM_LOOP

    ; ========================================================
    ; 方法一：结果放在寄存器中
    ; 求和结束后，AX 中直接保存结果 5050
    ; ========================================================


    ; ========================================================
    ; 方法二：结果放在数据段中
    ; MOV result,AX           ; 将结果保存到数据段变量 result
    ; MOV AX,result           ; 从数据段取回结果
    ; ========================================================

    ; ========================================================
    ; 方法三：结果放在栈中
    ; PUSH AX                 ; 将结果 5050 压入栈
    ; XOR AX,AX               ; 清空 AX
    ; POP AX                  ; 从栈中取回结果
    ; ========================================================
    CALL PRINT_DEC

    ; ---------- 返回 DOS ----------
    MOV AX,4C00H
    INT 21H

; ============================================================
; 子程序：将 AX 中的无符号整数转换为十进制并输出
; ============================================================

PRINT_DEC PROC
    PUSH AX
    PUSH BX
    PUSH CX
    PUSH DX

    MOV BX,10
    XOR CX,CX       ;寄存器清零

    ; 不断除以 10，将余数压栈
DIV_LOOP:
    XOR DX,DX
    DIV BX                   ;AX = 商，DX = 余数
    PUSH DX
    INC CX
    CMP AX,0
    JNE DIV_LOOP

    ; 逆序弹出余数并输出
PRINT_LOOP:
    POP DX
    ADD DL,'0'
    MOV AH,02H
    INT 21H
    LOOP PRINT_LOOP

    POP DX
    POP CX
    POP BX
    POP AX
    RET
PRINT_DEC ENDP

END START
